"""
主要内容：
1、变量及注释
2、变量的定义方式: 变量名称=变量值
"""

666.6
10
"hello world!"
# 这是单行注释（以空格隔开为好）
"""
这是多行注释
用三个引号
"""
# 输出各类字面量
print(666.6)
print(10)
print("hello world!") 

# 定义变量，记录钱包余额
money=130

print("你的钱包余额:", money, "元")
# 定义变量，记录商品价格
price=10

# 情景对话
print("拿一包滕王阁~")
print("需要支付:", price, "元")

# 重新赋值
money=money-price
print("消费后，你的钱包余额:", money, "元")

# 练习
# 钱包余额
money1=120
# 输出钱包余额
print("现在你的钱包余额:", money1, "元")
# 商品价格
icecream=10
print("拿一个icecream~", "需要支付:", icecream, "元")
"""
错误了，为甚，｛错误写法："可口可乐"=5
               正确写法：可口可乐 = 5
               变量赋值时左侧不能是字符串
             （变量名不能加引号，等号左边必须是合法变量名）｝
"可口可乐"=5
print("再来一瓶可口可乐~", "需要支付:", "可口可乐", "元")
"""
可口可乐=5
print("再来一瓶可口可乐~", "需要支付:", 可口可乐, "元")
# 消费
money1=money1-icecream-可口可乐
# 输出消费后的钱包余额
print("最终钱包剩余:", money1)